Revit 2027 API
MasonryCMU Class
 A static class that provides access to the property names that appear in the MasonryCMU visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.MasonryCMU
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MasonryCMU
Public NotInheritable Class MasonryCMU
public ref class MasonryCMU abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MasonryCMU = class end
The MasonryCMU type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "MasonryCMU" schema.
CommonTintToggle |  The property labeled "Tint" from the "MasonryCMU" schema.
MasonryCMUApplication |  The property labeled "Finish" from the "MasonryCMU" schema.
MasonryCMUColor |  The property labeled "Color" from the "MasonryCMU" schema.
MasonryCMUColorByObject |  The property labeled "Color By Object" from the "MasonryCMU" schema.
MasonryCMUPattern |  The property labeled "Relief Pattern" from the "MasonryCMU" schema.
MasonryCMUPatternHeight |  The property labeled "Amount" from the "MasonryCMU" schema.
MasonryCMUPatternMap |  The property labeled "Image" from the "MasonryCMU" schema.
MasonryCMUType |  The property labeled "Type" from the "MasonryCMU" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace